{
  "hidden_act": "gelu",
  "architectures": [
    "GPTNeoXForCausalLM"
  ],
  "bos_token_id": 0,
  "eos_token_id": 0,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "model_type": "gpt_neox",
  "hidden_size": 2560,
  "intermediate_size": 10240,
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "max_position_embeddings": 2048,
  "rotary_pct": 1.0,
  "rotary_emb_base": 10000,
  "torch_dtype": "float16",
  "use_cache": true,
  "use_parallel_residual": false,
  "vocab_size": 50304,
  "transformers_version": "4.23.1",
  "tokenizer_class": "GPT2Tokenizer"
}
